# AddButtonMode

## Description
Adds an image button to the mode bar for a tool. Replaces vstAddButtonMode.

```pascal
PROCEDURE AddButtonMode(imageSpecifier : DYNARRAY[] of CHAR);
```

```python

def vs.AddButtonMode(imageSpecifier):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|imageSpecifier|DYNARRAY[] of CHAR|The string identifier for the image. It should be of the form &quot;ResourceFileNameWithoutExtension/PathOfImageFile&quot;.|

## Version
Availability: from Vectorworks 2012
## Category
* Dialogs - Modern